app/Controllers/Dashboard.php

    public function index()
    {
        if (!auth()->user()->inGroup('superadmin')){
            return redirect()->to(base_url("supportticket"));
        }
         // Create a new Supporttickets model
         $supportticket = new \App\Models\Supporttickets();

         // Get the total number of tickets by severity
         $totalseverity = $supportticket->select('severity, count(*) as total')
             ->groupBy('severity')
             ->findAll();

         // Loop through the results and store them in an array
         foreach ($totalseverity as $row) {
             $data['totalseverity'][$row['severity']] = $row['total'];
         }

         // Get the total number of tickets by state
         $totalseverity = $supportticket->select('state, count(*) as total')
         ->groupBy('state')
         ->findAll();
---
SELECT `severity`, count(*) as total
FROM `supporttickets`
GROUP BY `severity`
SELECT COUNT(*) AS `numrows`
FROM `supporttickets`
SELECT `state`, count(*) as total
FROM `supporttickets`
GROUP BY `state`

         $office = new \App\Models\Offices();

         // Get all the offices
         $data['offices'] = $office->findAll();
---
SELECT *
FROM `offices`