app/Controllers/Office.php

SELECT COUNT(*) AS `numrows`
FROM `offices`
SELECT COUNT(*) AS `numrows`
FROM `offices`
WHERE `name` LIKE '%%' ESCAPE '!'
OR  `code` LIKE '%%' ESCAPE '!'
OR  `description` LIKE '%%' ESCAPE '!'
SELECT *
FROM `offices`
WHERE `name` LIKE '%%' ESCAPE '!'
OR  `code` LIKE '%%' ESCAPE '!'
OR  `description` LIKE '%%' ESCAPE '!'
ORDER BY `name` ASC
 LIMIT 5
---
    public function getall()
    {
        $request = service('request');
        $postData = $request->getPost();

        $response = array();

        ## Read value
        $draw = $postData['draw'];
        $start = $postData['start'];
        $rowperpage = $postData['length']; // Rows display per page
        $searchValue = $postData['search']['value']; // Search value

        ## Total number of records without filtering
        $office = new \App\Models\Offices();
        $totalRecords = $office->select('id')->countAllResults();

        ## Total number of records with filtering
        $totalRecordwithFilter = $office->select('id')
            ->orLike('name', $searchValue)
            ->orLike('code', $searchValue)
            ->orLike('description', $searchValue)
            ->countAllResults();

        ## Fetch records
        $records = $office->select('*')
            ->orLike('name', $searchValue)
            ->orLike('code', $searchValue)
            ->orLike('description', $searchValue)
            ->orderBy('name', 'asc')
            ->findAll($rowperpage, $start);