app/Controllers/Supportticket.php

    public function index()
    {

        $office = new \App\Models\Offices();
        $data['offices'] = $office->findAll();
---
SELECT *
FROM `offices`

    public function getall()
    {
        $request = service('request');
        $postData = $request->getPost();

        $response = array();

        ## Read value
        $draw = $postData['draw'];
        $start = $postData['start'];
        $rowperpage = $postData['length']; // Rows display per page
        $searchValue = $postData['search']['value']; // Search value

        ## Total number of records without filtering
        $supportticket = new \App\Models\Supporttickets();
        if (auth()->user()->inGroup('superadmin')) {
            $totalRecords = $supportticket->select('id')->countAllResults();
            ## Total number of records with filtering
            $totalRecordwithFilter = $supportticket->select('id')
                ->orLike('firstname', $searchValue)
                ->orLike('lastname', $searchValue)
                ->orLike('description', $searchValue)
                ->countAllResults();

            ## Fetch records
            $records = $supportticket->select('supporttickets.*, offices.name as office_name')
                ->join('offices', 'offices.id = supporttickets.officeid')
                ->orLike('supporttickets.firstname', $searchValue)
                ->orLike('supporttickets.lastname', $searchValue)
                ->orLike('supporttickets.description', $searchValue)
                ->orderBy('supporttickets.created_at', 'asc')
                ->findAll($rowperpage, $start);
---
SELECT COUNT(*) AS `numrows`
FROM `supporttickets`
SELECT COUNT(*) AS `numrows`
FROM `supporttickets`
WHERE `firstname` LIKE '%%' ESCAPE '!'
OR  `lastname` LIKE '%%' ESCAPE '!'
OR  `description` LIKE '%%' ESCAPE '!'
SELECT `supporttickets`.*, `offices`.`name` as `office_name`
FROM `supporttickets`
JOIN `offices` ON `offices`.`id` = `supporttickets`.`officeid`
WHERE `supporttickets`.`firstname` LIKE '%%' ESCAPE '!'
OR  `supporttickets`.`lastname` LIKE '%%' ESCAPE '!'
OR  `supporttickets`.`description` LIKE '%%' ESCAPE '!'
ORDER BY `supporttickets`.`created_at` ASC
 LIMIT 5

                ->countAllResults();

            ## Fetch records
            $records = $supportticket->select('supporttickets.*, offices.name as office_name')
                ->join('offices', 'offices.id = supporttickets.officeid')
                ->where('supporttickets.userid', auth()->id())
                ->groupStart()
                ->orLike('supporttickets.firstname', $searchValue)
                ->orLike('supporttickets.lastname', $searchValue)
                ->orLike('supporttickets.description', $searchValue)
                ->groupEnd()
                ->orderBy('supporttickets.created_at', 'asc')
                ->findAll($rowperpage, $start);
---
SELECT `supporttickets`.*, `offices`.`name` as `office_name`
FROM `supporttickets`
JOIN `offices` ON `offices`.`id` = `supporttickets`.`officeid`
WHERE `supporttickets`.`userid` = 1
AND   (
`supporttickets`.`firstname` LIKE '%%' ESCAPE '!'
OR  `supporttickets`.`lastname` LIKE '%%' ESCAPE '!'
OR  `supporttickets`.`description` LIKE '%%' ESCAPE '!'
 )
ORDER BY `supporttickets`.`created_at` ASC
 LIMIT 5

    public function getbyid($id)
    {
        $office = new \App\Models\Supporttickets();
        $data = $office->find($id);
---
SELECT *
FROM `supporttickets`
WHERE `supporttickets`.`id` = '4'